#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../theme.css">

#+NAME: add-bars
#+BEGIN_SRC emacs-lisp :exports none :results output
  (load-file "../bars.el")
#+END_SRC
#+CALL: add-bars()

#+TITLE: Compare two datsets

#+NAME: dataset1
| g1 | g2 | g3 | v1 |
|----+----+----+----|
|  1 |  1 |  1 |  1 |
|  1 |  2 |  1 |  2 |
|  1 |  1 |  2 |  3 |
|  1 |  2 |  2 |  4 |
|  2 |  1 |  1 |  1 |
|  2 |  2 |  1 |  2 |
|  2 |  1 |  2 |  3 |
|  2 |  2 |  2 |  4 |

#+NAME: dataset2
| g1 | g2 | g3 | v1 |
|----+----+----+----|
|  2 |  1 |  1 |  1 |
|  2 |  2 |  1 |  2 |
|  2 |  1 |  2 |  3 |
|  2 |  2 |  2 |  5 |
|  3 |  1 |  1 |  1 |
|  3 |  2 |  1 |  2 |
|  3 |  1 |  2 |  3 |
|  3 |  2 |  2 |  4 |

#+BEGIN_SRC R :var df1=dataset1 df2=dataset2 :colnames yes :exports both
  concatCols <- function(x) {
       x1 <- x[,1]
       x2 <- x[,2]
       x1[is.na(x1) & is.na(x2)] <- "NR"
       x1[!is.na(x2) & is.na(x1)] <- x2[!is.na(x2) & is.na(x1)]
       x2[!is.na(x1) & is.na(x2)] <- x1[!is.na(x1) & is.na(x2)]
       x1[x1!=x2] <- paste(x1[x1!=x2], "~", x2[x1!=x2])
       x1
  }

  combineSheets <- function(df1, df2, grouping_columns) {

      value_columns <- colnames(df1)[!colnames(df1) %in% grouping_columns]

      df3 <- merge(df1, df2, by=grouping_columns, all=TRUE)

      dataset1 <- apply(df3[grepl("\\.x$", colnames(df3))], 1, function(x) !all(is.na(x)))
      dataset2 <- apply(df3[grepl("\\.y$", colnames(df3))], 1, function(x) !all(is.na(x)))
      both <- dataset1 & dataset2
      which_dataset <- rep(FALSE, nrow(df3))

      which_dataset[both] <- "1 & 2"
      which_dataset[dataset1 & !both] <- "1"
      which_dataset[dataset2 & !both] <- "2"

      output <- df3[grouping_columns]
      for (value_column in value_columns) {
          a <- paste0(value_column, ".x")
          b <- paste0(value_column, ".y")
          output <- cbind(output, concatCols(df3[c(a, b)]))
      }

      output <- cbind(which_dataset, output)
      colnames(output) <- c("source", grouping_columns, value_columns)

      output
  }

  grouping_columns <- c("g1", "g2", "g3")

  combineSheets(df1, df2, grouping_columns)
#+END_SRC

#+RESULTS:
| source | g1 | g2 | g3 |    v1 |
|--------+----+----+----+-------|
|      1 |  1 |  1 |  1 |     1 |
|      1 |  1 |  1 |  2 |     3 |
|      1 |  1 |  2 |  1 |     2 |
|      1 |  1 |  2 |  2 |     4 |
|  1 & 2 |  2 |  1 |  1 |     1 |
|  1 & 2 |  2 |  1 |  2 |     3 |
|  1 & 2 |  2 |  2 |  1 |     2 |
|  1 & 2 |  2 |  2 |  2 | 4 ~ 5 |
|      2 |  3 |  1 |  1 |     1 |
|      2 |  3 |  1 |  2 |     3 |
|      2 |  3 |  2 |  1 |     2 |
|      2 |  3 |  2 |  2 |     4 |
